Yuanzjls/Audio_Player_stm32f769disco/Core/Src/main.cpp
/*gif call back functions start */
void screenClearCallback(void)
{
	BSP_LCD_Clear(LCD_COLOR_BLACK);
}
#if 0
void updateScreenCallback(void)
{
	uint32_t xPos = (BSP_LCD_GetXSize() - decoder.GetGifWidth())/2;
	uint32_t yPos = (BSP_LCD_GetYSize() - decoder.GetGifHeight())/2;
	CopyPicture((uint32_t *)IMAGEBUFF_ADDRESS, (uint32_t *)LAYER1_ADDRESS, xPos, yPos, decoder.GetGifWidth(), decoder.GetGifHeight());
}
void drawPixelCallback(int16_t x, int16_t y, uint8_t red, uint8_t green, uint8_t blue)
{
	*((uint32_t*)(IMAGEBUFF_ADDRESS+(x+y* (decoder.GetGifWidth()))*4)) = ((uint16_t)red << 16) | ((uint16_t)green << 8) | (blue);
}
#endif

/*gif call back functions end */
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
uint32_t FrameOffset=0;
const uint16_t block_size = 36864;
uint16_t buff[block_size];
#define PLAY_HEADER          0x2C
bool flag = 0;
uint8_t temp_data[100];
TaskHandle_t xTaskVolume = NULL;
TaskHandle_t xTaskMusic = NULL;
static TaskHandle_t xTaskGUI = NULL;
static TaskHandle_t xTaskTouchEx = NULL;
static void vTaskVolume(void *pvParameters)
{
  UBaseType_t  priority;
  uint32_t ulNotifiedValue;
  while(1)
  {

	  ulNotifiedValue = xTaskNotifyWait(0, 0xffffffff, &ulNotifiedValue, 400 );
	  if (ulNotifiedValue & 0x01)
	  {

			priority = uxTaskPriorityGet( NULL );
			vTaskPrioritySet(NULL, 0);
			wm8994_SetVolume(AUDIO_I2C_ADDRESS, volume);
			vTaskPrioritySet(NULL, priority);

	  }
	  BSP_LED_Toggle(LED2);
    //vTaskDelay(400);
  }
}


static void vTaskTouchEx(void *pvParameters)
{
	volatile uint32_t ulNotificationValue;
	TS_StateTypeDef  ts;
	static volatile GUI_PID_STATE TS_State = {0, 0, 0, 0};
	while(1)
	{
		ulNotificationValue = ulTaskNotifyTake( pdTRUE, 50 );


		if (ulNotificationValue==1)
		{
			BSP_TS_GetState((TS_StateTypeDef *)&ts);
			TS_State.Pressed = 1;
			TS_State.x = ts.touchX[0];
			TS_State.y = ts.touchY[0];
			GUI_PID_StoreState((const GUI_PID_STATE*)&TS_State);
		}
		else
		{
			if (TS_State.Pressed == 1)
			{
				TS_State.Pressed = 0;
				TS_State.x = -1;
				TS_State.y = -1;
				GUI_PID_StoreState((const GUI_PID_STATE*)&TS_State);;
			}
		}

	}
}
unsigned int RetrieveMP3Data(void * pMP3CompressedData,
unsigned int nMP3DataSizeInChars,
void * token)
{
	UINT nData_Read;

	f_read((FIL*)token, pMP3CompressedData, nMP3DataSizeInChars, &nData_Read);
	return nData_Read;
}

AudioTime Total_AudioTime;
extern char time_char[18];
WM_HWIN xhWin;
FATFS fs;
char filename[256];
extern uint8_t Play_Status;
static void vTaskMusic(void *pvParameters)
{
  FRESULT fr;
  DIR dj;
  FILINFO fno;

  unsigned int length=0;
  uint32_t ulNotifiedValue;

  WM_MESSAGE p;


  if (f_mount(&fs,(char*)"",1) == FR_OK)
  {
	fr = f_findfirst(&dj, &fno, "/Music", "*.wav");
	strcpy(filename, "/Music/");
	strcpy(&filename[7], fno.fname);
	if (fr == FR_OK && fno.fname[0])
	{

		f_open(&fi, filename, FA_READ);
		f_read(&fi, (void *)&Wheader, sizeof(Wheader), &length);
		f_lseek(&fi, PLAY_HEADER);
		f_read(&fi, buff, block_size*2, &length);

		Total_AudioTime.total_second = (f_size(&fi) - PLAY_HEADER) / 4 / Wheader.Samplerate;
		Total_AudioTime.second = Total_AudioTime.total_second % 60;
		Total_AudioTime.minute = Total_AudioTime.total_second / 60;
		Total_AudioTime.current_progress_insecond = 0;
		Total_AudioTime.current_minute = Total_AudioTime.current_progress_insecond / 60;
		Total_AudioTime.current_second = Total_AudioTime.current_progress_insecond % 60;

		sprintf(time_char, "%02d:%02d / %02d:%02d", Total_AudioTime.current_minute, Total_AudioTime.current_second,
						Total_AudioTime.minute, Total_AudioTime.second);
		Playback_Init(Wheader.Samplerate);
		xTaskNotifyWait(0, 0xffffffff, &ulNotifiedValue, portMAX_DELAY);
		HAL_SAI_Transmit_DMA(&SaiHandle, (uint8_t *)buff, block_size);
		p.MsgId = WM_USER_UPDATEFILENAME;
		p.Data.p = fno.fname;
		p.hWin = xhWin;

		WM_SendMessage(xhWin, &p);
        while(1)
        {
          xTaskNotifyWait(0, 0xffffffff, &ulNotifiedValue, 400 );
          if (ulNotifiedValue)
          {
            if (ulNotifiedValue  & 0x01)
            {
              f_read(&fi, &buff[block_size/2], block_size, &length);
            }   
            if (ulNotifiedValue  & 0x02)
            {
              f_read(&fi, &buff[0], block_size, &length);
            }
            if (ulNotifiedValue & 0x04)
            {
            	f_lseek(&fi, PLAY_HEADER +
            			Total_AudioTime.current_progress_insecond * 4
						* Wheader.Samplerate);
            	f_read(&fi, buff, block_size*2, &length);
            	Total_AudioTime.current_progress_insecond = (f_tell(&fi) - PLAY_HEADER) / 4 / Wheader.Samplerate;
            }
            if (ulNotifiedValue  & 0x07)
            {
            	Total_AudioTime.current_progress_insecond = (f_tell(&fi) - PLAY_HEADER) / 4 / Wheader.Samplerate;
				Total_AudioTime.current_minute = Total_AudioTime.current_progress_insecond / 60;
				Total_AudioTime.current_second = Total_AudioTime.current_progress_insecond % 60;
            	sprintf(time_char, "%02d:%02d / %02d:%02d", Total_AudioTime.current_minute, Total_AudioTime.current_second,
            							Total_AudioTime.minute, Total_AudioTime.second);
            }
            if (ulNotifiedValue & 0x08 )
            {
            	if (Play_Status == 1)
            	{
            		wm8994_Resume(AUDIO_I2C_ADDRESS);
					HAL_SAI_DMAResume(&SaiHandle);
            	}
            	else
            	{
            		wm8994_Pause(AUDIO_I2C_ADDRESS);
            		HAL_SAI_DMAPause(&SaiHandle);
            	}
            }
            if (f_tell(&fi) == f_size(&fi) || ulNotifiedValue &0x10)
            {
            	fr = f_findnext(&dj, &fno);
            	if (fr == FR_OK && fno.fname[0])
            	{
            		f_close(&fi);
            		strcpy(&filename[7], fno.fname);
            		f_open(&fi, filename, FA_READ);
					f_read(&fi, (void *)&Wheader, sizeof(Wheader), &length);
					f_lseek(&fi, PLAY_HEADER);
					f_read(&fi, buff, block_size*2, &length);
					Total_AudioTime.total_second = (f_size(&fi) - PLAY_HEADER) / 4 / Wheader.Samplerate;
					Total_AudioTime.second = Total_AudioTime.total_second % 60;
					Total_AudioTime.minute = Total_AudioTime.total_second / 60;
					Total_AudioTime.current_progress_insecond = 0;
					Total_AudioTime.current_minute = Total_AudioTime.current_progress_insecond / 60;
					Total_AudioTime.current_second = Total_AudioTime.current_progress_insecond % 60;
					WM_SendMessage(xhWin, &p);
					wm8994_SetFrequency(AUDIO_I2C_ADDRESS, Wheader.Samplerate);
            	}
            	else
            	{
            		f_lseek(&fi, f_size(&fi));
            		fr = f_findfirst(&dj, &fno, "/Music", "*.wav");
            	}
            }
            BSP_LED_Toggle(LED_RED);
          }
        }
	}

